tutorials/incompressible/pimpleFoam/RAS/propeller/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "innerCylinderSmall.obj"
    "outerCylinder.obj"
    "propellerStem1.obj"
    "propellerStem2.obj"
    "propellerStem3.obj"
    "propellerTip.obj"
);

// Identify a feature when angle between faces < includedAngle
includedAngle   150;

trimFeatures
{
    // Remove features with fewer than the specified number of edges
    minElem         10;
}

// ************************************************************************* //
